# -*- coding: utf-8 -*-
"""
Created on Tue Sep 14 10:48:23 2021

@author: 瑛
"""
#==============================================================================
# 字符串
#==============================================================================
var1 = 'Hello World!'
print ("已更新字符串 : ", var1[:6] + 'Runoob!')

print (r'\n')
print (R'\n')

#==============================================================================
#python 3.6
# name = 'Runoob'
# print(f'Hello {name}')  # 替换变量
#==============================================================================

print ("我叫 %s 今年 %d 岁!" % ('小明', 10))

#python三引号允许一个字符串跨多行，字符串中可以包含换行符、制表符以及其他特殊字符
para_str = """这是一个多行字符串的实例
多行字符串可以使用制表符
TAB ( \t )。
也可以使用换行符 [ \n ]。
"""
print (para_str)

#==============================================================================
# 列表list
#==============================================================================
list1 = ['Google', 'Runoob', 'Taobao']
list1.append('Baidu')
print ("更新后的列表 : ", list1)

for x in [1, 2, 3]: print(x, end=" ")

squares = [1, 4, 9, 16, 25]
squares += [36, 49, 64, 81, 100]
print(squares)

#==============================================================================
# 元组Tulpe
#==============================================================================
tup1 = ('Google', 'Runoob', 1997, 2000)
tup2 = (1, 2, 3, 4, 5 )
tup3 = "a", "b", "c", "d"   #  不需要括号也可以
print(type(tup3))


list1= ['Google', 'Taobao', 'Runoob', 'Baidu']
tuple1=tuple(list1)
print(tuple1)
print("内存地址：",id(tuple1))

#==============================================================================
# 字典dict
#==============================================================================
dict = {'Name': 'Runoob', 'Age': 7, 'Class': 'First'}
dict['Age'] = 8               # 更新 Age
dict['School'] = "菜鸟教程"  # 添加信息
print ("dict['Age']: ", dict['Age'])
print ("dict['School']: ", dict['School'])

dict = {'Name': 'Runoob', 'Age': 7, 'Name': '小菜鸟'}
#不允许同一个键出现两次。创建时如果同一个键被赋值两次，后一个值会被记住
print ("dict['Name']: ", dict['Name'])

#==============================================================================
# 集合（set）是一个无序的不重复元素序列。
#==============================================================================






















